import 'package:flutter/material.dart';
import 'package:google_maps_flutter/google_maps_flutter.dart';
import 'package:flutter_polyline_points/flutter_polyline_points.dart';

class Name {
  List<String> startDestinationName = [];

  void _NameClear() {
    startDestinationName.clear();
  }

  List<String> StartDestinationNameGet(int count) {
    _NameClear();
    if (count == 1) {
      //10
      startDestinationName = ["守口車庫前", "天満橋"];
    }
    if (count == 2) {
      //18
      startDestinationName = ["玉造", "北巽バスターミナル"];
    }
    if (count == 3) {
      //19
      startDestinationName = ["地下鉄今里", "加美東三丁目北"];
    }
    if (count == 4) {
      //21
      startDestinationName = ["天満橋", "地下鉄深江橋"];
    }
    if (count == 5) {
      //31
      startDestinationName = ["天満橋", "花博記念公園北口"];
    }
    if (count == 6) {
      //34
      startDestinationName = ["守口車庫前", "大阪駅前"];
    }
    if (count == 7) {
      //35
      startDestinationName = ["守口車庫前", "杭全"];
    }
    if (count == 8) {
      //45
      startDestinationName = ["総合医療センター前", "諸口"];
    }
    if (count == 9) {
      //46
      startDestinationName = ["天満橋", "焼野"];
    }
    if (count == 10) {
      //78
      startDestinationName = ["守口車庫前", "大阪駅前"];
    }

    return startDestinationName;
  }

  List<String> MarkersName10() {
    final Names10 = [
      //0
      "地下鉄太子橋今市（西）",
      //1
      "今市",
      //2
      "大宮小学校前",
      //3
      "中宮",
      //4
      "城北公園前",
      //5
      "生江",
      //6
      "赤川三丁目",
      //7
      "赤川一丁目（北）",
      //8
      "赤川一丁目（南）",
      //9
      "高座町三丁目",
      //10
      "高座町二丁目",
      //11
      "高座町一丁目",
      //12
      "地下鉄都島（都島工業高校前）",
      //13
      "地下鉄都島（南）",
      //14
      "都島中通",
      //15
      "都島区役所前",
      //16
      "東野田",
      //17
      "片町（北）",
      //18
      "片町（西）",
      //19
      "京阪東口",
    ];
    return Names10;
  }

  List<String> MarkersName18() {
    final Names18 = [
      //0
      "真田山",
      //1
      "天王寺スポーツセンター",
      //2
      "空清町",
      //3
      "清水谷町",
      //4
      "清水谷高校前",
      //5
      "上本町一丁目（東）",
      //6
      "上本町一丁目（南）",
      //7
      "上本町四丁目",
      //8
      "上本町六丁目駅（北）",
      //9
      "上本町六丁目駅（近鉄前）",
      //10
      "上本町六丁目東",
      //11
      "小橋町",
      //12
      "鶴橋駅前（東）",
      //13
      "東小橋",
      //14
      "鶴橋二丁目",
      //15
      "御幸通",
      //16
      "桃谷駅筋",
      //17
      "桃谷中学校",
      //18
      "生野区役所前",
      //19
      "大池橋（西）",
      //20
      "大池橋（東）",
      //21
      "巽北一丁目",
      //22
      "北巽小学校前",
      //23
      "巽北二丁目",
    ];
    return Names18;
  }

  List<String> MarkersName19() {
    final Names19 = [
      //0
      "猪飼野橋",
      //1
      "中川西公園前",
      //2
      "新今里三丁目",
      //3
      "生野中央病院",
      //4
      "巽北一丁目北",
      //5
      "巽北三丁目東",
      //6
      "地下鉄北巽",
      //7
      "巽中一丁目",
      //8
      "巽中学校前",
      //9
      "巽東二丁目",
      //10
      "地下鉄南巽（西）",
      //11
      "新巽中学校前",
      //12
      "南巽五丁目",
      //13
      "平野馬場一丁目",
      //14
      "両国橋",
      //15
      "JR平野駅",
      //16
      "JR平野駅筋",
      //17
      "平野宮前",
      //18
      "平野宮前二丁目",
      //19
      "平野東一丁目（西）",
      //20
      "加美",
      //21
      "加美小学校前",
      //22
      "加美東一丁目",
      //23
      "加美東三丁目",
    ];
    return Names19;
  }

  List<String> MarkersName21() {
    final Names21 = [
      //0
      "京阪東口",
      //1
      "片町（西）",
      //2
      "京橋駅南口",
      //3
      "朝日橋",
      //4
      "新北二丁目",
      //5
      "新北大橋",
      //6
      "極楽橋",
      //7
      "放出西一丁目",
      //8
      "放出西三丁目",
      //9
      "放出住宅前（南）",
      //10
      "諏訪二丁目",
      //11
      "諏訪三丁目",
    ];
    return Names21;
  }

  List<String> MarkersName31() {
    final Names31 = [
      //0
      "京阪東口",
      //1
      "片町（西）",
      //2
      "東野田",
      //3
      "京橋北口（京橋駅筋）",
      //4
      "蒲生桜小橋",
      //5
      "蒲生三丁目",
      //6
      "地下鉄蒲生四丁目（西",
      //7
      "地下鉄蒲生四丁目（東）",
      //8
      "今福西四丁目（南）",
      //9
      "今福西四丁目（北）",
      //10
      "関目二丁目南",
      //11
      "関目二丁目",
      //12
      "関目四丁目",
      //13
      "新森二丁目（南）",
      //14
      "新森公園前",
      //15
      "新森二丁目（北）",
      //16
      "地下鉄新森古市",
      //17
      "緑一丁目東",
      //18
      "緑三丁目",
    ];
    return Names31;
  }

  List<String> MarkersName34() {
    final Names34 = [
      //0
      "地下鉄太子橋今市（西）",
      //1
      "今市",
      //2
      "大宮小学校前",
      //3
      "中宮",
      //4
      "城北公園前",
      //5
      "生江",
      //6
      "赤川三丁目",
      //7
      "大東町",
      //8
      "毛馬町二丁目",
      //9
      "毛馬橋",
      //10
      "長柄東",
      //11
      "長柄西",
      //12
      "天神橋筋八丁目",
      //13
      "本条西二丁目",
      //14
      "豊崎神社前",
      //15
      "豊崎北",
      //16
      "地下鉄中津",
      //17
      "済生会病院前",
    ];
    return Names34;
  }

  List<String> MarkersName35() {
    final Names35 = [
      //0
      "太子橋今市（西）",
      //1
      "今市",
      //2
      "今市一丁目",
      //3
      "千林",
      //4
      "森小路",
      //5
      "高殿七丁目",
      //6
      "高殿",
      //7
      "地下鉄関目成育",
      //8
      "関目一丁目",
      //9
      "城東区役所前",
      //10
      "地下鉄蒲生四丁目",
      //11
      "新喜多大橋",
      //12
      "新喜多東",
      //13
      "鴨野（南）",
      //14
      "鴨野駅前",
      //15
      "東中浜一丁目",
      //16
      "中浜",
      //17
      "地下鉄緑橋",
      //18
      //"東中本二丁目",
      //19
      "東中本三丁目",
      //20
      //"地下鉄今里（北）",
      //21
      "地下鉄今里（南）",
      //22
      //"猪狩野橋",
      //23
      "中川西公園前",
      //24
      "中川二丁目",
      //25
      //"大池中学校前",
      //26
      "大池橋（北）",
      //27
      //"生野消防署前",
      //28
      "田島三丁目",
      //29
      "田島五丁目",
      //30
      //"田島六丁目",
    ];
    return Names35;
  }

  List<String> MarkersName45() {
    final Names45 = [
      //0
      "地下鉄都島（東）",
      //1
      "地下鉄本通四丁目",
      //2
      "都島本通五丁目",
      //3
      "地下鉄野江内代",
      //4
      "成育三丁目",
      //5
      "成育二丁目",
      //6
      "関目一丁目",
      //7
      "すみれ市場前",
      //8
      "関目二丁目南",
      //9
      "関目二丁目",
      //10
      "関目四丁目",
      //11
      "新森二丁目南",
      //12
      "地下鉄新森古市",
      //13
      "緑一丁目（東）",
      //14
      //"緑三丁目",
      //15
      "緑四丁目",
      //16
      "鶴見緑地西",
      //17
      "鶴見商業高校前",
      //18
      "鶴見緑地公園前",
      //19
      "鶴見区役所前",
      //20
      "諸口一丁目",
      //21
      "今津橋",
      //22
      "今津諸口橋",
      //23
      "諸口二丁目",
      //24
      "諸口四丁目",
      //25
      "諸口四丁目北",
    ];
    return Names45;
  }

  List<String> MarkersName46() {
    final Names46 = [
      //0
      "京阪東口",
      //1
      "片町（西）",
      //2
      "城見一丁目",
      //3
      "鴨野西一丁目",
      //4
      "鴨野西三丁目",
      //5
      "鴨野（東）",
      //6
      "新喜多東一丁目",
      //7
      "放出西一丁目",
      //8
      "放出西三丁目",
      //9
      "放出住宅前（西）",
      //10
      "放出住宅前（東）",
      //11
      "放出東二丁目",
      //12
      "汎愛高校前",
      //13
      "今津中三丁目",
      //14
      "今津比枝神社前",
      //15
      "得庵駅口",
      //16
      "今津橋",
      //17
      "諸口一丁目",
      //18
      "鶴見区役所前",
      //19
      "諸口",
      //20
      "東諸口",
      //21
      "浜三丁目",
      //22
      "浜四丁目",
      //23
      "焼野町一丁目",
    ];
    return Names46;
  }

  List<String> MarkersName78() {
    final Names78 = [
      //0
      "地下鉄太子橋今市（西）",
      //1
      "今市",
      //2
      "今市一丁目",
      //3
      "千林",
      //4
      "森小路",
      //5
      "大宮一丁目",
      //6
      "旭区役所",
      //7
      "旭区民センター",
      //8
      "旭警察署",
      //9
      "旭陽中学校前",
      //10
      "高殿二丁目",
      //11
      "御幸町二丁目",
      //12
      "御幸町一丁目",
      //13
      "内代町",
      //14
      "都島本通五丁目",
      //15
      "都島中通三丁目",
      //16
      "都島中通二丁目",
      //17
      "都島中通",
      //18
      "都島区役所前",
      //19
      "中野町三丁目",
      //20
      "中野町四丁目",
      //21
      "源八橋",
      //22
      "扇町",
      //23
      "太融寺町",
      //24
      "曽根崎警察署",
    ];
    return Names78;
  }
}
